NEW_SKU = '''Введите номер SKU товара на WB:'''

START_MSG = '''💪 Вся мощь искусственного интеллекта ChatGPT к твоим услугам!

🔥 Создаем карточку товара для  Wildberries.ru и OZON.ru без SEO-специалиста и копирайтера за 10 минут.

Расскажи, какой товар нужно описать и бот самостоятельно создаст продающее описание товара. Текст будет отлично индексирован поисковыми машинами WB и OZON. Более того, Яндекс и Google так же будут индексировать твою карточку, как уникальный текст!

❓ Как это работает
- Загружаешь боту карточку похожего товара
- Описываешь ключевые особенности своего товара
- Добавляешь нестандартные SEO слова и фразы (стандартные бот сам соберет)
- Просишь бота создать описание
🔥 Вуаля! Описание готово.

Не понравилось описание?! Измени его, просто написав об этом боту. Спрашивай, все что угодно, он все сделает.😁 Или можешь повторно создать новое описание используя другие стили. Без SEO-специалистов и копирайтеров. За 10 минут. Твори, как тебе хочется.

💬 Мы в стадии бета-теста. С ошибками, зато бесплатно.😁 Если что-то работает не так, как ты ожидал или чего-то не хватает - напиши в группу @wb_cards или в личку @dk_gpt'''


CHATGPT_MSG = '''Раздел ChatGPT:'''

PRODUCT_MSG = '''Раздел товара:'''

HELP_PRODUCT = '''♨️  **Готовим данные по товару**

Краткое описание пунктов меню. Больше деталей <a href="https://telegra.ph/Nastrojka-kartochki-tovara-03-18">вот тут</a>

**SKU:** загрузить с WB товар-аналог
**Главное о товаре:** ключевые характеристики твоего товара
**Дополнительно:** дополнительные данные твоего товара

Данные из карточки товара-аналога

**Название:** название товара
**Характеристики:** характеристики товара
**Описание:** описание товара
**SEO-словарь:** SEO словарь для выбранного товара
**SEO+:** расширение SEO словаря, которое нужно добавить
**Помощь:** этот help
**Назад:** в главное меню'''

HELP_CHATGPT = '''😇  **Включаем "режим бога"**

Тут начинается настоящая магия и создается карточка.

**Создать описание:** создать новую карточку товара
**Добавить SEO+** скорректировать карточку товара
**Стиль:** какой стиль использовать в описании
**Сбросить диалог:** сбросить диалог с ChatGPT
**Помощь:** этот help
**Назад:** в главное меню

Расширенное описание доступно тут'''

STYLE_DESC = '''🎉  **Стиль карточки**

Можно изменить стиль бота ChatGPT: Обычный, Креативный, Формальный.
Попробуй разные варианты и выбери, какой больше подходит.'''
